{"enjoy": {"explaination": "Sir... I think you have choosen to enjoy a lot. I would suggest you with some movie spots and \n                        pubs where you can enjoy to get high and some quality free time at places where there would be \n                        less population. Enjoy sir.. and please don't et too high.. :P and if you are watching a movie please have a companion.... ", "true": ["movie_hall", "coffee", "ccd", "mc donalds", "kfc", "wine", "smoking", "pvr", "donuts", "pubs"]}, "school": {"explaination": "school stuff related", "true": ["schools", "colleges", "study_center"]}, "shopping": {"explaination": "\n   sir... you need to have a great experience time with what you shop... Give this\n   me as a responsibility to optimize the places and filter the search so that you get the \n   most wise and good experience ", "true": ["mall", "local market"]}, "family": {"explaination": "sir... This is a family trip I suppose.. Whatever must be the situation you need to look sober in front of your family. I would plan out every possible places where there is no \navailability of wines,drugs and bakes.. :D :D  ", "true": ["mc donalds", "kfc", "mall", "donuts"]}, "relax": {"explaination": "Haha... Quite bored from life.. \nAccording to your statement you made... it seems you ought to plan a movie or a get together... \nSir... I should plan out a combo strategy for u .... where you would get around with friends \nand chill out quite the whole day...\nI would rather make a whole day schedule for u.. \nI would rather do a proimity search for food+movies... and hope I well serve the master.. :P D", "true": ["movie_hall", "pvr", "smoking", "wine", "pubs"]}, "miss": {"explaination": "Sir.. According to you query I see you have started missing someone... Let me match interest \nof the person to your interest and plan out a gettogether and hangout.. :D :D"}, "sleep": {"explaination": "\nYou need to take rest.. Please stop if u are driving... and I would prefer to get to nearby coffee shops and let me arrange that", "true": ["cofee", "ccd"]}, "dating": {"explaination": " Sir.. on ur demand I would try to arrange \n    the best place for you to dine and for the counter lucky one... I would ensure that\n    the privacy is maintained.. Wish u good luck for ur date... ;)... Hope I would have been \n    alive to see that", "true": ["movie_hall", "coffee", "ccd", "pvr"]}, "friends": {"explaination": "Sir... Friends are the choosen ones...Looking at your statement I think that you need a great \n                                companion and quality time with friends.. Let me plan out the best hangout places aound you that you can enjoy with your friends... Call someone.. At this time I cannot provide you with great humor as I myself being in a developpment phase.. :D :D ", "true": ["movie_hall", "kfc", "wine", "mall", "smoking", "pvr"]}}